Revit API Introduction Labs
LabUtils.TypeSelectionFilter.AllowReference Method
 Allow all the reference to be selected
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public bool AllowReference(
	Reference reference,
	XYZ position
)
Visual Basic (Declaration)
Public Function AllowReference ( _
	reference As Reference, _
	position As XYZ _
) As Boolean
Visual C++
public:
virtual bool AllowReference(
	Reference^ reference,
	XYZ^ position
) sealed
Parameters
reference
Type: Reference
A candidate reference in selection operation.
position
Type: XYZ
The 3D position of the mouse on the candidate reference.
Return Value
Return true to allow the user to select this candidate reference.
Implements
ISelectionFilterAllowReference(Reference, XYZ)
See Also
LabUtils.TypeSelectionFilter Class
Labs Namespace